OdDAI.AttributeDataBlock.getValueSpecifiedTypePath(OdDAI.AttributeDataBlock!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets value type path. If the attribute data block contains OdDAIObjectId,
the function returns the type name of this application instance.
\param getFrom [in] attribute data block to get type path from.
\returns the specified type path.

OdDAI.AttributeDataBlock.unset
\details
Clear all data.

OdDAI.AttributeDataBlock.toString
\details
Translate internal data to string.
\returns the internal data represented as a string.

OdDAI.AttributeDataBlock.op_Assign(OdDAI.AttributeDataBlock!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copy one attribute data block to another.
\param rightValue [in] attribute data block to copy from.
\returns the reference to itself.

OdDAI.AttributeDataBlock.op_Equality(OdDAI.AttributeDataBlock!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Compare two attribute data block.
\param rightValue [in] other attribute data block to compare.
\returns true if equal, and false otherwise.

OdDAI.AttributeDataBlock.#ctor(OdDAI.AttributeDataBlock!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor copy. Creates a new empty instance of attribute data block and init data from the right value.
\param rightValue [in] Attribute Data Block to copy from.

OdDAI.AttributeDataBlock
\details
Class of attribute data block should used for simple select data moving/coping/editing.